## plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray
random_id.this: Refreshing state... [id=3A]
data.http.my_public_ip: Reading...
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
aws_vpc.this[0]: Refreshing state... [id=vpc-0253c98dbfb2527bc]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
random_shuffle.az: Refreshing state... [id=-]
aws_subnet.public[0]: Refreshing state... [id=subnet-0bcb86926463a54da]
aws_security_group.lan[0]: Refreshing state... [id=sg-05eea34b7c5aad93d]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0bb7ce12cebee95cc]
aws_security_group.public[0]: Refreshing state... [id=sg-06ed1ac4a4a40a5df]
aws_security_group.trusted[0]: Refreshing state... [id=sg-0f1628227c3620510]
aws_subnet.private[0]: Refreshing state... [id=subnet-05d3787cbf200ae15]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "pub-rtb-sophos-xgdc-447552758530"
        }
+       tags_all         = {
+           "Name" = "pub-rtb-sophos-xgdc-447552758530"
        }
+       vpc_id           = "vpc-0253c98dbfb2527bc"
    }

  # aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-0f1628227c3620510"
      ~ ingress                = [
+           {
+               cidr_blocks      = [
+                   "20.10.17.177/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
-           {
-               cidr_blocks      = [
-                   "20.225.222.31/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
        tags                   = {
            "Name" = "Trusted Network"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"     
```